Процедура ОбработкаПроведения(Отказ, РежимПроведения)

	Если Сумма <= 0 Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Сумма выдачи должна быть больше нуля.";
		Сообщение.Сообщить();
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
    Движения.ДенежныеСредстваВКассах.Записывать = Истина;
    Движение = Движения.ДенежныеСредстваВКассах.Добавить();
    Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
    Движение.Период = Дата;
    Движение.Касса = Касса;
    Движение.Сумма = Сумма;

КонецПроцедуры